app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "one love"], ["created_at", "2020-02-17 18:32:38.435413"], ["updated_at", "2020-02-17 18:32:38.435413"], ["artist_id", 3]]
---
  def create
    @song = Song.new(song_params)
    binding.pry
    if @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 5], ["updated_at", "2020-02-17 19:29:28.330552"], ["id", 4]]
---
  def update
    binding.pry
    @song = Song.find(params[:id])

    @song.update(song_params)